app/Controllers/PaginasController.php

    public function verPagina($slug = null)
    {
        // Instanciar los modelos una sola vez
        $paginaModel     = new PaginaModel();
        $seccionModel    = new SeccionModel();
        $componenteModel = new ComponenteModel();

        // 1. Buscar la página por slug y estado activo
        $pagina = $paginaModel
            ->where('slug', $slug)
            ->where('activo', 1)
            ->first();

        if (!$pagina) {
            // Si no existe, mostrar error 404
            throw PageNotFoundException::forPageNotFound();
        }

        // 2. Obtener las secciones activas y ordenadas de la página
        $secciones = $seccionModel
            ->where('pagina_id', $pagina['id'])
            ->where('activo', 1)
            ->orderBy('orden')
            ->findAll();

        // 3. Para cada sección, obtener sus componentes activos y ordenados
        foreach ($secciones as &$seccion) {
            $seccion['componentes'] = $componenteModel
                ->where('seccion_id', $seccion['id'])
                ->where('activo', 1)
                ->orderBy('orden')
                ->findAll();
---
SELECT *
FROM `paginas`
WHERE `slug` = 'bodegas'
AND `activo` = 1
 LIMIT 1
SELECT *
FROM `componentes`
WHERE `seccion_id` = '2'
AND `activo` = 1
ORDER BY `orden`